// 003컴파일complie.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

// 전처리문 
#include <iostream>

// 디버깅
// 디버깅 또는 디버그 라고 하며, 컴퓨터 프로그램 개발 단계 중에
// 발생하는 시스템적의 논리적인 오류나 비정상적인 연산을 찾아내어
// 그 원인을 밝히고 수정하는 작업과정을 뜻한다.
 
// 디버그 모드 사용시
// 디버그, x64 = x64 폴더안에 exe 파일생성
// 디버그, x86 = Debug 폴더안에 exe 파일생성
 
// F5를 누르게 되면 디버그 모드 실행
// F5, F9(중단지점설정,break point) 
// F10(한줄씩보기), F11(한줄씩보면서 함수안으로 들어감) 
// 각각의 기능이 있음

// 전처리기
// 주석삭제, include를 통한 코드 복사 붙여넣기 
// 컴파일 직전에 실행되는 별도의 프로그램
// 컴파일러가 실행되기 전 단순히 텍스트를 조작하는 치환 역할
// 디버깅에 도움을 주며 헤더 파일의 중복 포함도 방지하는 기능도 있다.

// 컴파일러

// 어셈블러

// 링커 

// 함수
int main()
{
    // 코드
    std::cout << "Hello World!\n";
}


