// 005변수.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

int main()
{
    // 공격력을 만들고 0을 집어넣어야 한다.
    // int - 4바이트 정수형
    // Att - 함수의 이름 
    // 0 - 상수
    // 상수란? - 프로그램이 실행되고 나면 절대로 바꿀 수 없는 값
    // exe 파일에 새겨진 값 
    // ; = 여기까지 실행해라. 
    // F5를 누르지 않았다면 ~ 를 만들고 ~ 를 해야한다. 라는 것이
    // 기재되어 있는 텍스트파일 이라고 생각하면 된다. 

    // 리터럴 초기화 
    int Att = 0;



    // 4바이트 메모리를 할당해라
    // 이름과 순서는 Att(사람한테는 Att지만, 컴퓨터는
    // 컴파일러에 의해 1812312번째 바이트로 인식)
    // 메모리가 만들어지면 집어넣어라
    // 코드 영역에 존재하는 ? 번째 바이트의 
    // 4바이트 메모리 영역에 있는 값을 

    int Att = 100; 

        

}

