// ConsoleApplication1.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

int main()
{
   //형상관리 프로그램, SCM
   //형상관리란?
   //소프트 웨어의 변경점을 체계적으로 추적하고 관리하는 일렬의 활동
   //단순히 버전 관리 뿐만 아니라, 소프트웨어의 생명 주기동안
   //요구사항, 설계문서, 소스코드, 각종 결과물에 대해서 형상을 만들고
   //변경시점등을 체계적으로 관리하는 소프트웨어 개발에서 필수이다.
   //형상관리 툴의 종류는 CVN, SVN , Git 등이 있으며 
   //각각의 프로그램마다 장단점이 존재한다. 
   //회사마다 쓰는 프로그램이 다름. 

   
	//형상관리 프로그램이란?
	//소프트웨어 개발시 각종 결과물에 대하여 형상을 만들고
	//변경시점 등을 체계적으로 관리하는 도움을 주는 프로그램이다. 
	
   


}

