// 008-1연산자메모.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

int main()
{
    //산술연산자
    //- + * / %

    //비교연산자
    // < > <= >= != == 

    //논리연산자
    //&&(논리형and)= 왼쪽과 오른쪽을 비교하여 모두 참이라면 참
    //||(논리형or)= 왼쪽과 오른쪽을 비교하여 하나라도 참이라면 참
    //int a = !b; (논리형부정,논리부정) = !우측에 있는 값의 반대값
   
    // 비트연산자
    // int a = ~0;
    // 비트반전, 모든 비트를 반전시킨다. 
    // &(비트and) 위 아래의 비트를 비교하여 둘다 1이라면 1 아니면 0
    // |(비트or) 위 아래의 비트를 비교하여 둘 중하나라도 1이라면 1 아니면 0
    // ^(비트xor,배타적논리합) 
    // 위 아래의 비트를 비교하여 서로 다르다면 1 아니라면 0 
   
}

