// 001영역기본개념.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

//전처리문
#include <iostream>

// 절대 변하지 않는 규칙
// 램에 올라가지 않으면 실행된 것이 아니다.
// 프로그램을 실행하려면 비용을 지불해야 한다. (전력과 메모리 = 비용)
// 전력과 메모리를 사용해야 하기 때문에 프로그램이 실행되어
// 프로세스가 되면 메모리를 사용해야 하기 때문에 용량이 커지게 된다. 

// 하드 > 램 (OS) > 레지스터 > CPU (코어)

//함수 
//int - 리턴값
//main - 그 함수의 이름
//() - 인자 라고 한다. 
int main()
{
    //코드

    //용량의 개념
    //박스라고 생각, 1과 0으로 구성되어 있는 박스 = bit
    //이 박스가 8개 모이면 바이트 라고 한다.
    //8bit - 1byte(B)
    //1024byte = 1Kbyte(KB)
    //1024kbyte = 1Mbyte(MB)
    //1024mbyte = 1Gbyte(GB)

   
    

}

